{"children":[{"children":[{"children":[{"children":[{"children":null,"tag":"literal","value":"Beauty and understanding"}],"tag":"chapter","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"chap:beauty"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"This chapter focuses on what beauty has to do with understanding, first from a theoretical perspective, and then diving specifically into how specific domains approach this relation. Our theoretical approach will be based on the aesthetic theory of Nelson Goodman, and a lineage which links aesthetics to cognition, most recently aided by the contribution of neurosciences."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"After argumenting for a conception of aesthetics which tends to intellectual, rather than emotional, engagement, we will pay attention to how surface structure and conceptual assemblages relate. That is, we will highlight how each of the domains contigent to source code— literature, mathematics and architecture—communicate certain concepts through their respective and specific means of symbolic representation."}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Aesthetics and cognition"}],"tag":"section","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"sec:aesthetic-cognition"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"The way that things are presented formally—which we've defined as their aesthetics—have been empirically shown to affect the comprehension of content. Without engaging too directly in the media-determination thesis, which states that what one can say is determined by the medium through which they say it, be it language or technical media, we nonetheless start from the point that form influences content"},{"children":[{"children":null,"tag":"literal","value":"postman_amusing_1985"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". "}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Jack Goody and Walter Ong have shown in their anthropological studies that the primary means of communication of the surveyed communities does affect the engagement of said communities with concepts such as ownership, history and governance"},{"children":[{"children":null,"tag":"literal","value":"ong_orality_2012,goody_logic_1986"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". More recently, Edward Tufte and his work on data visualization have furthered this line of research by focusing on the translation of similar data from textual medium to graphic medium"},{"children":[{"children":null,"tag":"literal","value":"tufte_visual_2001"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". A case has indeed been made for the impact of appearance towards structure, both in source code and elsewhere. To complement this comparative approach between several mediums, we now look at how source code performs expressively as a specific system, starting from Nelson Goodman's theorization of such a system.."}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Source code as a language of art"}],"tag":"subsection","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"subsec:source-code-language-art"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"From the question of the nature of the aesthetic experience from the perspective of the audience, whether as an aesthetic emotion being felt or as an aesthetic judgment being given, we shift our attention to the object of aesthetic experience, and to the questions of"},{"children":[{"children":null,"tag":"literal","value":"how does a work represent?"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":"and"},{"children":[{"children":null,"tag":"literal","value":"what does a work represent?"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":". To answer these, we rely on answers provided by by Nelson Goodman in the"},{"children":[{"children":null,"tag":"literal","value":"Languages of Art: An Approach to a Theory of Symbols"}],"tag":"emph","value":""},{"children":[{"children":null,"tag":"literal","value":"goodman_languages_1976"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":"and"},{"children":[{"children":null,"tag":"literal","value":"The Structure of Appearance"}],"tag":"emph","value":""},{"children":[{"children":null,"tag":"literal","value":"goodman_structure_1966"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"The starting point for Goodman's analysis is that production and understanding in the arts involve human activities that, though they differ in specific ways among themselves and from other activities, are nevertheless generically related to perception, scientific inquiry, and other cognitive activity, and such an activity specifically involves symbolic systems. It is those two components that Goodman aims at expliciting: what constitutes an aesthetic symbol system, and how does it express?"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Goodman develops a systematic approach to symbols in art, freed from any media-specificity (e.g. from pictorial symbols to musical notations and even time marks on clocks and watches). A symbolic system, in his definition, consists of characters, along with rules to govern their combination with other characters, itself correlated with a field of reference. These symbols and their arrangement within a work of art supports an aesthetic experience"},{"children":[{"children":null,"tag":"literal","value":"It should be noted here that Goodman does not limit the aesthetic experience to a positive, pleasurable one. An artistic symbolic system can be seen even if the result is considered bad."}],"tag":"footnote","value":"1"},{"children":null,"tag":"literal","value":". A work, as a part, particular arrangement of a symbol system according to specific syntactic and semantic rules, can therefore enable an aesthetic experience."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"A symbol system is based on five requirements: a system should be composed of signs which are unambiguous, syntactically and semantically disjointed, and differentiated"},{"children":[{"children":null,"tag":"literal","value":"goodman_languages_1976"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". This classification makes it possible to compare the various symbolization systems used in art, science, and life in general: from clocks to counters, from diagrams to maps models, from musical scores to painters' sketches and scripts (intended in a broad sense as the characters of natural languages). In our case, this provides us for a framework to investigate the extent to which source code qualifies as a language of art."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Source code is written in a formal linguistic system called a programming language. Such a linguistic system is, obviously, digital in nature, and therefore satisfies at least the syntactic requirements of disjointedness, differentiation (a mark only ever corresponds to that symbol, such as a variable or function name), as well as syntactic repleteness (relatively fewer factors need to be taken into account during the interpretative process)"},{"children":[{"children":null,"tag":"literal","value":"This does not mean that any program text written in this symbolic system will tend to be syntactically replete. On the contrary, the tendency of program text to veer towards verbosity implies the desirable state of repleteness."}],"tag":"footnote","value":"2"},{"children":null,"tag":"literal","value":". This does qualify source code as a potential language for art, through which aesthetic expressiveness can emerge."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"As Goodman notes, the distinct signs that compose a symbols system do not have intrinsic properties, but a thing serves as a sign only in relation to a symbol system, and a field of reference. Some requirements need to be fulfilled for such a symbol to be what is called a symptom of the aesthetic. Amongst exemplification, syntactic density, semantic density and syntactic repleteness, source code fulfills the last two criteria: with a limited set of symbols (at one of the lowest levels, only two symbols, traditionally marked as 0 and 1), programs can refer to and enact complex states and behaviours."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"The field of reference is understood her as being the set of concepts which are being referred to by a symbolic system. For instance, a symbolic system such as western classical music can refer to concepts such as lament, piety, heroism or grace, while a chine"},{"children":[{"children":null,"tag":"literal","value":"shanshui"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":"painting has a landscape composed of mountains and rivers as its field of reference. The combination of both the problem domain, as evoked in"},{"children":[{"children":null,"tag":"literal","value":"chap:understanding"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":", and of the technological environment on which the source code is to be executed, is posited here as an equivalent to the Goodman's field of reference."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Now that we have highlighted what a symbolic system is, we turn to how such a system can signify and reference a particular field of reference."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Goodman highlights the ways in which symbols systems communicate, through the notion of"},{"children":[{"children":null,"tag":"literal","value":"reference"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":". To refer to, in this sense, is the action by which a symbol stands in for an item. Reference, he sketches out, takes place through the different dyads of denotation and exemplification, description and representation, possession and expression"},{"children":[{"children":null,"tag":"literal","value":"goodman_languages_1976"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". We will see how these various means of referring can be instantiated in the symbolic system of source code."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"First, then, denotation; it is the core of representation, a reference from a symbol to one or many objects it applies to and is independent of resemblance. Rather, it uses a particular relationship via the use of labels; that is, a symbol stands in for an item in the field of reference. For instance, a name denotes its bearer and a predicate each object in its extension. Names such as variable names or function names thus denote a particular item in the field of reference, and act as their label. For instance,"},{"children":[{"children":null,"tag":"literal","value":"var auth_level"}],"tag":"inline_listing","value":""},{"children":null,"tag":"literal","value":"denotes an ability to access and modify resources."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"The labelling process therefore serves as the symbolic expression for a particular field. In source, this can happen through variable naming (as seen above), but also through type definition"},{"children":[{"children":null,"tag":"literal","value":"For instance, a particular choice of a numeric value, such as"},{"children":[{"children":null,"tag":"literal","value":"int"}],"tag":"inline_listing","value":""},{"children":null,"tag":"literal","value":"or"},{"children":[{"children":null,"tag":"literal","value":"float"}],"tag":"inline_listing","value":""},{"children":null,"tag":"literal","value":"denote a particular level of preciseness"}],"tag":"footnote","value":"3"},{"children":null,"tag":"literal","value":", as well as additional affordances which we look at in"},{"children":[{"children":null,"tag":"literal","value":"sec:programming-aesthetic-framework"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Source code also make extensive use of description. If we consider a program text as a series of steps, a series of states, or a series of instructions, then it follows that source code is leaning heavily on the side of description, when it comes to its power of reference. Indeed, a program text is a description of how to solve a problem from the computer's perspective, written extensively in machine language"},{"children":[{"children":null,"tag":"literal","value":"Pseudo-code is therefore a representation of a potential source code written in a specific language."}],"tag":"footnote","value":"4"},{"children":null,"tag":"literal","value":". All source code can therefore be said to be a description of a combination of action and states."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"States are also a particular case in source code: they are both a description and, because they are not the thing itself, they are also a representation. As one can see in"},{"children":[{"children":null,"tag":"literal","value":"code:representation"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":", an individual can be represented within source code with a particular construct (here called a"},{"children":[{"children":null,"tag":"literal","value":"struct"}],"tag":"inline_listing","value":""},{"children":null,"tag":"literal","value":")."}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":[{"children":[{"children":null,"tag":"literal","value":"./corpus/representation.rs"}],"tag":"code","value":"rust"}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"An example of how source code can be a representation an individual, and can exemplify encapsulation, written in Rust."}],"tag":"caption","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"code:representation"}],"tag":"label","value":""}],"tag":"paragraph","value":""}],"tag":"listing","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"This representation, in the specific instance of object-oriented programming in"},{"children":[{"children":null,"tag":"literal","value":"code:representation"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":", also manifests Goodman's aesthetic symptom of possession. Here, the source code posseses similar properties as the thing referenced (since our prototypal image of a person has an age, a name and interests). Through this possession of a property, it acts as an example of a prototypal person."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Exemplification is another aspect of Goodman's theory, which has nonetheless remained somewhat limited"},{"children":[{"children":null,"tag":"literal","value":"elgin_making_2011"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". A symbol exemplifying, also called an examplar, is considered as a stand-in for an item in the field of reference. Specifically for source, code, this is a case that we have seen in"},{"children":[{"children":null,"tag":"literal","value":"subsec:scientists"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":", where a particular source code is written in order to act as an example of a broader concept. For instance, a program text can, at a lower level, exemplify a particular kind of procedure, such as encapsulation or nestedness. The program text therefore exemplifies the constitutive element of the linked list"},{"children":[{"children":null,"tag":"literal","value":"A linked list is a basic data structure in computer science, which consists in a succession of connected objects."}],"tag":"footnote","value":"5"},{"children":null,"tag":"literal","value":". However, a similar program text can also be an example of cleanliness, of clarity, or elegance (see"},{"children":[{"children":null,"tag":"literal","value":"sec:ideals-beauty"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":"): a program text written by a software developer can be seen as possessing the property of cleanliness, by virtue of its implementation of syntactic and semantic rules, while another program text written by a hacker can be seen as highlighting detailed hardware knowledge."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Additionally, the features a symbol exemplifies depends on its function (or, more precisely, its functional context)"},{"children":[{"children":null,"tag":"literal","value":"elgin_understanding_1993"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". A symbol can perform a variety of function: a piece of code in a textbook might exemplify an algorithm, while the same piece of code in production software might be seen as a liability, or as a boring section in a code poem."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Source code maintains specific features on its relation to the field of reference. On the one hand, a particular class of characters employed as symbols (also called"},{"children":[{"children":null,"tag":"literal","value":"tokens"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":"in the context of programming languages), do not maintain a clear relationship with the items in the field of reference. That is, in program texts, two distinct symbols can be referring to the same concept, value, or place in memory (see"},{"children":[{"children":null,"tag":"literal","value":"chap:programming"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":"for a further explanation of these differences and"},{"children":[{"children":null,"tag":"literal","value":"code:multiple_references"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":"for an example), something Goodman nonetheless assigns as another symptom of the aesthetic: multiple and complex references."}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":[{"children":[{"children":null,"tag":"literal","value":"./corpus/multiple_references.rs"}],"tag":"code","value":"rust"}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"The system of value, references and pointers make source code into a highly complex symbolic system."}],"tag":"caption","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"code:multiple_references"}],"tag":"label","value":""}],"tag":"paragraph","value":""}],"tag":"listing","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"On the other hand, the representation of a field of reference is done through a disjointed and differentiated system: the boundaries of each items in the field of reference are clearly defined, in virtue of the specific symbol system that programming languages are. These programming languages do dictate the rules of engagement of the symbolic system with the field of reference."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"We have shown here that source code qualifies as a symbolic system susceptible of affording symptoms of the aesthetic. We have also highlighted its specificities, particularly in terms of descriptions and representations, and of complex and multiple references. Source code being a dual language, between human and machine, makes it have such complex and multiple references. A final aspect to investigate is the expressiveness of source code, with a particular attention to how source code can manifest of metaphorical exemplification and representation."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"The particular expressive power of an aesthetic experience surfaces when the examplification involves a foreign element, an event that Goodman refers to as metaphorical exemplification. While this approach has been broadened by Lakoff et. al., and mentioned in"},{"children":[{"children":null,"tag":"literal","value":"subsec:metaphor-computation"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":", philosophers of art have pinpointed the metaphorical event as a reliable symptom of the aesthetic."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Max Black initiates a view of metaphors which go beyond a simple comparison; dubbed the"},{"children":[{"children":null,"tag":"literal","value":"interaction view"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":", he considers the metaphorical device as containing positive cognitive content. Simply paraphrasing a metaphor, even if one captures precisely the same connotations/associations as the metaphor, does not convey the same meaning as the metaphor itself"},{"children":[{"children":null,"tag":"literal","value":"For instance, saying"},{"children":[{"children":null,"tag":"literal","value":"Je chavire dans l'écume des phénomènes"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":"does not have the similar expressive power as listing all the properties of"},{"children":[{"children":null,"tag":"literal","value":"phénomènes"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":". The original sentence is from Beckett."}],"tag":"footnote","value":"6"},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"This is subsequently taken up by Monroe Beardsley in his analysis of the metaphorical twist, by which a metaphor transforms a property into a sense. At the the heart of the work of the metaphor, he says, is the internal tension inherent between the central meaning of the referring character,or symbol, and the peripheral meaning, to which attention is shifted to capture subtle implications for the item that is being referred to, thus including connotation as a way of representation along with denotation."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Finally, Catherine Elgin has pursued the work of Goodman by furthering the inquiry into arts as a branch of aesthetics. Drawing on the work mentioned above, she investigates the relationship between art and understanding, stating that aesthetics then is the branch of epistemology that explains how interpretively indeterminate symbols advance understanding"},{"children":[{"children":null,"tag":"literal","value":"elgin_understanding_2020"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":", and that it does so in the context of interpretive indeterminacy. As syntactically and semantically dense symbol systems are used in artworks,  it is this multiplicity in interpretations which requires sustained cognitive attention with the artwork. To explain these multiple interpretations, the metaphor is again presented the key device in explaining the epistemic potency of aesthetics, based on an interpretative feedback loop from the viewer. And yet, in the context of source code, this interpretation is always shadowed by its machine counterpart of how the computer interprets the program."}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Contemporary approaches to art and cognition"}],"tag":"subsection","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"subsec:art-cognition-contemporary"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"We have this s far drawn from existing work in philosophy of art, in order to map out the expressive power of a given formal representation, as a traditional pre-requisite to the gaining of art status of an object, and highlighted the crucial role of metaphors in engaged cognition in an aesthetic experience. Contemporary literature, and the emergence of neuroscientific studies of such aesthetic experience seem to confirm empirically this approach, and highlight as well two related additional components: sequential experience and skill levels."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"The aesthetic experience—that is, the positively received perception of a natural or crafted object—has traditionally been laid out across multiple axes, with more or less overlap. Whether this positive perception is due to an emotional response, to a harmonious assessment, to an axiomatic adherence or to disinterested pleasure has indeed been the topic of debates amongst philosophers for centuries"},{"children":[{"children":null,"tag":"literal","value":"peacocke_aesthetic_2023"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Noël Carroll sums up these different directions under the broad areas of affect, axiom and content"},{"children":[{"children":null,"tag":"literal","value":"carroll_aesthetic_2002"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". He underlines how an aesthetic experience dictated by affect removes the object from one's assessment of purpose, value and effect, and limiting it to form, following Kant's principle of disinterested pleasure via passive contemplation. As such, a flower, a sunset or a musical melody can evoke affective aesthetic experiences. Yet, the supposed tendency of this kind of experience to release us from worldly concerns fails, for Carroll, to encompass aesthetic experiences that are rooted in so-called worldly concerns—such as a documentary photography, skillful physical performance, or delicatedly crafted glassware—and is therefore unsatisfying as a root explanation for the aesthetic experience."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"An axiomatic aesthetic experience is, in turn, based on the sort of value that the object is being associated with—such as depiction of religious topics or a manifestation of a particular style. While Carroll does acknowledge a certain virtue of this aesthetic experience in terms of contribution to group cohesion through shared values and imaginaries, its limitations are found in a pre-existing answer to the value judgment that is being bestowed upon the object—the material and sensual properties of the object at hand are irrelevant since their quality is already decided"},{"children":[{"children":null,"tag":"literal","value":"a priori"}],"tag":"emph","value":""},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"It is in the content approach that Carroll finds the most satisfying answer to what the aesthetic experience is. Content, here, is defined as the forms being apprehended, along with its combinations, juxtapositions and comparisons with other forms. When we engage with the sensual aspects or an object, our attention is indeed directed first and foremost at what the object looks like. More specifically, Carroll notes, if attention is directed with understanding to the form of the art work or to its expressive and aesthetic properties or to the interaction between those features, then the experience is said to be aesthetic"},{"children":[{"children":null,"tag":"literal","value":"carroll_aesthetic_2002"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Form, and the attention to form, will thus be taken as our starting point.  This content approach to form, i.e. the set of appearing choices intended to realize the purpose of the artwork, involves questions of function, implied by the presence of purpose pertaining to an artwork. Particulary, how does the object of aesthetic experience manifest this purpose, in such a way that it can be correctly judged, insofar as its perceived form and perceived purpose are aligned, distinct from any emotional or axiomatic charge?"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"This analysis is complemented by the study conducted by Anjan Chatterjee and Oshin Vartanian on the evaluation of the aesthetic experience from a neuroscientific point of view. Like Carroll, they highlight three different perspectives: a sensory-motor perspective, loosely mapped to an affective experience, an emotion-valuation perspective, similar to an axiological experience, and a meaning-knowledge experience, which we equate to the content approach to the aesthetic experience"},{"children":[{"children":null,"tag":"literal","value":"chatterjee_neuroscience_2016"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Additionally, they make the distinction between an aesthetic judgment, which emanates from the process of understanding the work, and an aesthetic emotion, which follows from the ease of acquisition of such an understanding. Without being mutually exclusive, these two pendants are related to the amount of engagement provided by the person who aesthetically experiences the object. One can have an aesthetic emotion without being able to provide an aesthetic judgment, a case in which one does not hold enough expertise to apprehend or appreciate a particular realisation. In this sense, the aesthetic judgment, unlike the aesthetic emotion, requires something additional. This conditioning of the aesthetic experience to a certain kind of pre-existing knowledge or skill is supported by the authors' mention of the theory of fluency-based aesthetics"},{"children":[{"children":null,"tag":"literal","value":"chatterjee_neuroscience_2016"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":", and their view builds on models that frame aesthetic experiences as the products of sequential and distinct information-processing stages, each of which isolates and analyzes a specific component of a stimulus (e.g., artwork)."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"These stages, based on Leder et. al's model, are based on empirical observation in scientific studies which segment an aesthetic experience in sequential steps"},{"children":[{"children":null,"tag":"literal","value":"leder_model_2004"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". These evolve form perception, to implicit classification, explicit classification, cognitive mastering and evaluation—that is, fully-qualified aesthetic judgment. This conception is concomittant to Rebert et. al.'s proposal for an aesthetic framework based on processing fluency, which they define as a function of the perceiver's processing dynamics: the more fluently the perceiver can process an object, the more positive is her aesthetic response"},{"children":[{"children":null,"tag":"literal","value":"reber_processing_2004"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":". While they focus their study on perceptual fluency, tending to traditional aesthetic features such as symmetry, contrast and balance; they also consider conceptual fluency as an influence on the aesthetic experience, through the attention given to the meaning of a stimulus and the relation to semantic knowledge structures. Such a conceptualizing thus hints at a similar skill-based, contextual framework which we have seen for the aesthetic judgment of source code, and yet an additional establishment of a relation between truth and beauty"},{"children":[{"children":null,"tag":"literal","value":"\"these findings suggest that judgments of beauty and intuitive judgments of truth may share a common underlying mechanism. Although human reason conceptually separates beauty and truth, the very same experience of processing fluency may serve as a nonanalytic basis for both judgments.\""},{"children":[{"children":null,"tag":"literal","value":"reber_processing_2004"}],"tag":"citation","value":""}],"tag":"footnote","value":"7"},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"This approach of cognitive ease, which we've already identified in"},{"children":[{"children":null,"tag":"literal","value":"chap:ideals"}],"tag":"reference","value":""},{"children":null,"tag":"literal","value":", is finally echoed in the view that Gregory Chaitin, a computer scientist and mathematician, offers of comprehension as compression. By considering that the understanding of a topic is correlated with the lower cognitive burden experienced when reasoning about such topic, Chaitin forms a view in which an individual understands better through a properly tuned model—a model that can explain more with less"},{"children":[{"children":null,"tag":"literal","value":"zenil_compression_2021"}],"tag":"citation","value":""},{"children":null,"tag":"literal","value":"."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"spacer","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"These studies thus show a particular empirical attention to the cognitive engagement with respect to the apprehension an object from an aesthetic perspective, as opposed to passive contemplation or value-driven aggreement. While these other types of experiences remain valid when apprehending such an object, we do focus here on this specific kind of experience: the cognitive approach to the aesthetic experience. Goodman describes such an experience as involving:"}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":[{"children":null,"tag":"literal","value":"making delicated discriminations and discerning subtle relationships, identifying symbol systems and what these characters denote and exemplify, interpreting works and reorganizing the world in terms of works of art and works in termins of the world."},{"children":[{"children":null,"tag":"literal","value":"goodman_languages_1976"}],"tag":"citation","value":""}],"tag":"paragraph","value":""}],"tag":"quote","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"spacer","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"In this section we've glanced at an overview of research on how cognitive engagement is involved in an aesthetic experience, both from the point of view of the philosophy of art and psychology. However, highlighting this involvment does not immediately explicit the nature and details of such cognitive engagement. Speaking in terms of form and object are higher-level concepts which tend to erase the specificities of the various systems of aesthetic properties, and how their arrangement expresses various concepts. Now that we have sketched out an understanding of source code as a symbolic system supporting an aesthetic experience, we must provide a more detailed account of the specificities of source code. To do so, we turn to a comparative approach, looking at the set of aesthetic domains located contingently to source code through programmer discourse, and we analyse how each  of these domains involve cognition in their formal presentations."}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Literature and understanding"}],"tag":"section","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"sec:aesthetic-literature"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Ricoeur - Métaphore vive"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Lakoff (take away from chap 2.)"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"barthes"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"voleshov and social aesthetics"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"mace-styles-critiques-de-nos-formes-de-vie"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"rousset: forme et signification"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"flusser: bringing into the realm of prose"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"portela-scripting-reading-motions"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Bouchardon - Valeur heuristique de la littérature numérique"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"N. Katherine Hayles - Speech, Writing Code, My Mother Was A Computer"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Françoise Lavocat - interprétation et sciences cognitives, dimension spatiale de la représentation textuelle."}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Jérôme Pelletier -  L'attrait esthétique de la fiction : un point de vue de philosophie cognitive /  La Fiction comme Culture de la Simulation"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Marie-Laure Ryan - Complexity"},{"children":[{"children":null,"tag":"literal","value":"http://marilaur.info/complexity.pdf"}],"tag":"url","value":""},{"children":null,"tag":"literal","value":"/ Mapping and Geography"},{"children":[{"children":null,"tag":"literal","value":"http://marilaur.info/2018-mapping.pdf"}],"tag":"url","value":""},{"children":null,"tag":"literal","value":"/ "},{"children":[{"children":null,"tag":"literal","value":"https://ohiostatepress.org/books/BookPages/ryanetal_narrating.html"}],"tag":"url","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Architecture and understanding"}],"tag":"section","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"sec:arch-understanding"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"https://plato.stanford.edu/entries/architecture/"}],"tag":"url","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"https://books.google.de/books/about/Philosophy_for_Architects.html?id=qUJ7KzsXpTsC&redir_esc=y"}],"tag":"url","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"The world of architecture has accrued its own set of design values over the years. One of those values is the principle of material honesty. One material should not be used as a substitute for another. Otherwise the end result is deceptive."},{"children":[{"children":null,"tag":"literal","value":"keith_resilient_2016"}],"tag":"citation","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Cette influence des spécificités techniques sur le choix d'une scène ne signifie pas que l'appareil photographique produirait un résultat prévisible, qui ne dirait rien de l'auteur, mais que certaines orientations techniques seraient plus justes. Ce qui donne de l'effet à l'image, c'est cette correspondance entre l'objet et la technique Walter Benjamin in http://www.softphd.com/these/walter-benjamin-authenticites/pensee-declin"}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"https://beautiful.software/"}],"tag":"url","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"habitability, navigation, landscape cognition, relationship between form and function"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"patterns and beacons"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"compression"}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Forms of scientific activity"}],"tag":"section","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"sec:aesthetic-scientific"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"This section looks at the forms of sciences and activity"}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Mathematics and elegance"}],"tag":"subsection","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"sec:aesthetic-mathematics"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"poincaré"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Epiphany, enlightenment"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"all the reading resources from alberto"}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"Making and understanding"}],"tag":"subsection","value":""}],"tag":"paragraph","value":""},{"children":[{"children":[{"children":null,"tag":"literal","value":"subsec:aesthetic-engineering"}],"tag":"label","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"Learning by doing, craft, extract from chap 2"}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"spacer","value":""}],"tag":"paragraph","value":""},{"children":[{"children":null,"tag":"literal","value":"In conclusion, we have seen that there is a clear connection between aesthetics and cognition, and that it exists across domains. For literature, it is about accessing three-dimensional space through two-dimensional surface and one-dimensional sentences. For architecture, it is about cognition as ability to modify and act within, as well as the ability to derive the meaning of things from their appearances. In mathematics, it is about compressing the maximum amount of insight (which is different from just knowledge) in the minimum amount of explanation/tokens. For engineering it's not quite sure yet, but it's related to architecture: how functional (in the social and technical sense) it is."}],"tag":"paragraph","value":""}],"tag":"root","value":""}],"tag":"include","value":"beauty.tex"}